# ZonePhaseId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ZonePhaseId Property
ParameterTypeId Class See Also
---
"Phase Id"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ZonePhaseId { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ZonePhaseId As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ZonePhaseId {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace